password = input("Введiть пароль: ")

(dov, ts, v_b, m_b, sym) = (0, 0, 0, 0, 0)

for char in password:
    if len(password) >= 8: dov = 1                         # dov - довжина паролю
    if char.isdigit(): ts = 1                              # ts - наявнiсть цифр у паролi
    if char.isupper(): v_b = 1                             # v_b - велика буква
    if char.islower(): m_b = 1                             # m_b - мала буква
    s_s = "`~!@#$%^&*()_-+={}[]\|:;\"'<>,.?/"              # s_s - спецiальнi символи
    if any(char in s_s for char in password): sym = 1      # sym - наявнiсть спец. символiв
    sum = dov + ts + v_b + m_b + sym                       # Кiлькiсть набраних балiв
print(f"Мiцнiсть пароля: {sum} з 5!")

if sum == 5:
    print("Ваш пароль вiдповiдає всiм вимогам безпеки!")
if dov == 0:
    print("""Довжина Вашого пароля повинна бути як мiнiмум 8 символiв.
Ось причина:
Чим довше пароль, тим складніше його підібрати. Рекомендується використовувати паролі довжиною не
менше 8 символів, щоб забезпечити достатній рівень безпеки. Однак, для підвищення безпеки рекомен-
дується використовувати паролі довжиною 12-16 символів.
""")
if ts == 0:
    print("""У Вашому паролi повиннi мiститися цифри.
Ось причина:
Використання цифр у паролі покращує його безпеку. Пароль, що містить тільки літери, може бути легко
вгадано або підібрано методом перебору або словникової атаки. Якщо пароль містить як літери, так і
цифри, то його стає набагато складніше підібрати методом перебору, тому що для злому потрібно пере-
брати більше варіантів.
""")
if v_b == 0:
    print("""У Вашому паролi повиннi мiститися великi лiтери.
Ось причина:
Використання в паролі хоча б однієї великої літери робить його складнішим для вгадування чи підбору.
Це пов'язано з тим, що більшість людей вважають за краще використовувати лише маленькі літери як па-
ролі, і хакери часто використовують цю інформацію для перебору паролів.
""")
if m_b == 0:
    print("""У Вашому паролi повиннi мiститися маленькi лiтери.
Ось причина:
Використання маленьких букв у паролі підвищує його безпеку, тому що це робить пароль різноманітнішим
та важчим для підбору. Особливо коли вони йдуть не зе порядком, а хаотично.
""")
if sym == 0:
    print("""У Вашому паролi повиннi мiститися спецiальнi символи.
Ось причина:
Використання спеціальних символів у паролі робить його більш складним для підбору, тому що це усклад-
нює роботу перебірних програм. Крім того, багато веб-сайтів і програм вимагають використання спеціаль-
них символів у паролях для того, щоб убезпечити своїх користувачів або клієнтів.
""")