import math
"""
1. Задача про коло:
Обчисліть площу кола з радіусом 8.
2. Задача про трикутник:
Знайдіть гіпотенузу прямокутного трикутника зі сторонами 3 та 4.
3. Задача з округленням вгору:
Округліть число 12.46 вгору до найближчого цілого.
4. Задача з округленням вниз:
Округліть число 2.47 вниз до найближчого цілого.
5. Задача з факторіалом:
Знайдіть факторіал числа 17.
6. Задача про ступінь:
Піднесіть число 2 до 16-ї ступеня (2-ма способами).
7. Задача про пошук максимуму:
Знайдіть максимальне число зі списку: [15, 8, 12, 20, 5].
"""

# Task 1
rad = 8
P = math.pi * math.pow(8, 2)
print(f"Площа кола: {P}")

# Task 2
katet1 = 3
katet2 = 4
gipotenusa = math.sqrt(math.pow(katet1, 2) + math.pow(katet2, 2))
print(f"гіпотенуза прямокутного трикутника: {gipotenusa}")

# Task 3
number1 = 12.46
new_number1 = math.ceil(number1)
print(f"Число округлене вгору до найближчого цілого: {new_number1}")

# Task 4
number2 = 2.47
new_number2 = math.floor(number2)
print(f"Число округлене вниз до найближчого цілого: {new_number2}")

# Task 5
number3 = 17
num_factorial = math.factorial(number3)
print(f"Факторіал числа {number3} = {num_factorial}")

# Task 6
stupin_1 = math.pow(2, 16)
stupin_2 = 2 ** 16
print(f"Піднесення числа 2 до 16 ступеня (1 спосіб): {stupin_1}")
print(f"Піднесення числа 2 до 16 ступеня (2 спосіб): {stupin_2}")

# Task 7
num_list = [15, 8, 12, 20, 5]
max_num = max(num_list)
print(f"Максимальне число зі списку: {max_num}")
